# 格式化字符串
a = 'hello'

# 1.字符串之间也可以进行加法运算
# 两个字符串相加会变成一串

a = 'abc' + 'haha' + '哈哈'
# 字符串不能和别的类型进行加法运算
# print("a ="+a)

a = 123
# print('a = ',a)

# 2.在创建字符串时，可以在字符串中指定占位符
# %s 在字符串中表示任意字符
# %f 浮点数占位符
# %d 整数占位符
b = 'hello %s'%'我'
b = 'hello %s 你好 %s'%('tom','yiyiyi')
b = 'hello %3.5s'%'你我' # %3.5s字符串长度限制在3-5之间
b = 'hello %.2f'%(123.456)
b = 'hello %d'%(123.95)
# print(b)

# 3.格式化字符串，可以在字符串签添加一个f来创建一个格式化字符串
# 在格式化字符串中可以直接嵌入变量
c = f'hello {a} {b}'
# print(c)
print(f'a = {a}')

# 练习
# name = '随便'
# print('欢迎%s光临'%(name))


