# 什么是对象
#   对象时内存中专门用来存储数据的一块区域
#   对象中可以存放各种数据(数字、布尔值、代码)
#   对象三部分
#       1.id    2.type  3.value

# 面向对象(oop)(object oriented programing)
#   python是一门面向对象的编程语言
#   语言中的所有操作都是通过对象来进行的
#   面向过程的编程语言
#       面向过程指将我们的程序的逻辑分解为一个一个的步骤
#           通过对每个步骤的抽象，来完成程序
#       面向过程的编程思想，将一个功能分解为一个一个小的步骤，
#           我们通过完成小步骤来完成一个程序
#       这种编程方式，符合我们人类的思维，编写起来相对比较简单
#       但是这种方式编写的代码往往只适用于一个功能
#           实现别的功能，即使功能相差极小，往往要重新编写代码，可服用性比较低
#               并且难于维护
# 
#   面向对象的编程语言，关注的是对象，而不关注过程
#       对于面向对象的语言来说，一切都是对象
#       面向对象的编程思想，将所有的功能统一保存到对应的对象中
#           要使用某个功能，直接找到对应的对象即可
#   使用这种方式编写的代码，比较容易阅读，并且比较易于维护
#   但是这种方式的编写，不太符合常规的思维，编写起来麻烦
#   
#   面向对象思想:
#       1.找对象
#       2.搞对象